# 판다스 Series

from pandas import Series

# 1 test
# data = [100,200,300,400]
# s = Series(data)
# print(s)

# 2
data = ['2018-08-01', '2018-08-02', '2018-08-03', '2018-08-04', '2018-08-05', '2018-08-06']
xrp_close = [512,508,512,507,500,503]
s = Series(xrp_close, index=data)
# dictionary type = key : value 에 맞게
#날짜에 맞는 값 추가

# print(s)

# 결과
# 인덱스1(기본번호)  인덱스2(커스텀번호)    값(값)
#   0               2018-08-01              512
#   1               2018-08-02              508
#   2               2018-08-03              512
#   3               2018-08-04              507
#   4               2018-08-05              500
#   5               2018-08-06              503

# print(s[0]) #인덱스1 호출
# print(s['2018-08-01']) #인덱스2 호출

# print(s.index) #모든 인덱스만 호출
# print(s.values) #모든 값만 호출

# print(s['2018-08-01' : '2018-08-04']) # 2018-08-01 부터 2018-08-04 까지
# print(s[0:4]) #0인덱스부터 3번인덱스까지(4번전까지)

